perf/results/single-node/1-breakpoint/cfg-breakpoint.yaml
config:
  environments:
    nodeping:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    nodeasync:
      target: 'http://localhost:5555/node/async'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    # - name: Ramp      # useful only for /ping
    #   duration: 300
    #   arrivalRate: 10
    #   rampTo: 10000
    - name: Slow Ramp # used by slow endpoints
      duration: 300   # seconds
      arrivalRate: 1
      rampTo: 8000
    - name: Reset Line  # useful for resetting Grafana stats
      duration: 30
      arrivalRate: 1

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'